# vi: filetype=brewfile
# Brewfile.devops
#
# Maintained by Pedro Garcia Rodriguez <pedgarrod@gmail.com>
# http://www.breakingpitt.es/

cask_args appdir: "/Applications"

tap 'hashicorp/tap'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap "homebrew/core"
tap 'homebrew/bundle'

brew "ansible"
brew "ansible-lint"
brew "aws-nuke"
brew "awscli"
brew "docker"
brew "git"
brew "git-extras"
brew "hadolint"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "lazydocker"
brew "pre-commit"
brew "shellcheck"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "trivy"
brew "asciinema"
brew "curl"
brew "exa"
brew "fzf"
brew "gzip"
brew "htop"
brew "jq"
brew "lynx"
brew "mtr"
brew "navi"
brew "neofetch"
brew "newsboat"
brew "p7zip"
brew "poetry"
brew "poppler"
brew "rclone"
brew "rsync"
brew "screen"
brew "starship"
brew "task"
brew "thefuck"
brew "tldr"
brew "tre-command"
brew "unzip"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zoxide"

cask "alfred"
cask "appcleaner"
cask "bitwarden"
cask "brave-browser"
cask "cryptomator"
cask "cyberghost-vpn"
cask "docker"
cask "fantastical"
cask "firefox"
cask "intellij-idea"
cask "iterm2"
cask "notion"
cask "pycharm"
cask "the-unarchiver"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
