# vi: filetype=brewfile
# Brewfile
#
# Maintained by Pedro Garcia Rodriguez <me@pgarcia.es>
# Website: http://www.pgarcia.es/

cask_args appdir: "/Applications"

tap "buo/cask-upgrade"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"

brew "ansible"
brew "ansible-lint"
brew "asciinema"
brew "awscli"
brew "aws-nuke"
brew "bat"
brew "btop"
brew "curl"
brew "docker"
brew "fzf"
brew "git"
brew "git-extras"
brew "gnupg"
brew "gzip"
brew "hadolint"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "htop"
brew "hugo"
brew "jq"
brew "lazydocker"
brew "lynx"
brew "mas"
brew "mtr"
brew "navi"
brew "neofetch"
brew "newsboat"
brew "p7zip"
brew "pinentry-mac"
brew "poppler"
brew "pre-commit"
brew "shellcheck"
brew "rclone"
brew "rsync"
brew "screen"
brew "starship"
brew "task"
brew "terraform-docs"
brew "thefuck"
brew "tflint"
brew "tfsec"
brew "tldr"
brew "trivy"
brew "tre-command"
brew "unzip"
brew "watch"
brew "watchexec"
brew "watchman"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zoxide"

cask "alfred"
cask "appcleaner"
cask "calibre"
cask "discord"
cask "docker"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "intellij-idea-ce"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keybase"
cask "librewolf"
cask "namechanger"
cask "pycharm-ce"
cask "rectangle"
cask "slack"
cask "the-unarchiver"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
